; domain
(define (domain dlog_2_2_2-domain)
 (:requirements :strips :typing)
 (:types
    location locatable - object
    driver truck obj - locatable
 )
 (:predicates (at_ ?obj - locatable ?loc - location) (in ?obj1 - obj ?obj_0 - truck) (driving ?d - driver ?v - truck) (link ?x - location ?y - location) (path ?x - location ?y - location) (empty ?v - truck))
 (:action load_truck
  :parameters ( ?obj_1 - obj ?truck - truck ?loc - location)
  :precondition (and (at_ ?truck ?loc) (at_ ?obj_1 ?loc))
  :effect (and (not (at_ ?obj_1 ?loc)) (in ?obj_1 ?truck)))
 (:action unload_truck
  :parameters ( ?obj_1 - obj ?truck - truck ?loc - location)
  :precondition (and (at_ ?truck ?loc) (in ?obj_1 ?truck))
  :effect (and (not (in ?obj_1 ?truck)) (at_ ?obj_1 ?loc)))
 (:action board_truck
  :parameters ( ?driver - driver ?truck - truck ?loc - location)
  :precondition (and (at_ ?truck ?loc) (at_ ?driver ?loc) (empty ?truck))
  :effect (and (not (at_ ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))
 (:action disembark_truck
  :parameters ( ?driver - driver ?truck - truck ?loc - location)
  :precondition (and (at_ ?truck ?loc) (driving ?driver ?truck))
  :effect (and (not (driving ?driver ?truck)) (at_ ?driver ?loc) (empty ?truck)))
 (:action drive_truck
  :parameters ( ?truck - truck ?loc_from - location ?loc_to - location ?driver - driver)
  :precondition (and (at_ ?truck ?loc_from) (driving ?driver ?truck) (link ?loc_from ?loc_to))
  :effect (and (not (at_ ?truck ?loc_from)) (at_ ?truck ?loc_to)))
 (:action walk
  :parameters ( ?driver - driver ?loc_from - location ?loc_to - location)
  :precondition (and (at_ ?driver ?loc_from) (path ?loc_from ?loc_to))
  :effect (and (not (at_ ?driver ?loc_from)) (at_ ?driver ?loc_to)))
)

; problem
(define (problem dlog_2_2_2-problem)
 (:domain dlog_2_2_2-domain)
 (:objects
   s0 s1 s2 p1_0 p1_2 - location
   driver1 driver2 - driver
   truck1 truck2 - truck
   package1 package2 - obj
 )
 (:init (at_ driver1 s2) (at_ driver2 s2) (at_ truck1 s0) (empty truck1) (at_ truck2 s0) (empty truck2) (at_ package1 s0) (at_ package2 s0) (path s1 p1_0) (path p1_0 s1) (path s0 p1_0) (path p1_0 s0) (path s1 p1_2) (path p1_2 s1) (path s2 p1_2) (path p1_2 s2) (link s0 s1) (link s1 s0) (link s0 s2) (link s2 s0) (link s2 s1) (link s1 s2))
 (:goal (and (at_ driver1 s1) (at_ truck1 s1) (at_ package1 s0) (at_ package2 s0)))
)

; plan
1. (walk driver1 s2 p1_2)
   deleted: (at_ driver1 s2)
   added: (at_ driver1 p1_2)
   goals met: 2 of 4
2. (walk driver1 p1_2 s1)
   deleted: (at_ driver1 p1_2)
   added: (at_ driver1 s1)
   goals met: 3 of 4
3. (walk driver1 s1 p1_0)
   deleted: (at_ driver1 s1)
   added: (at_ driver1 p1_0)
   goals met: 2 of 4
4. (walk driver1 p1_0 s0)
   deleted: (at_ driver1 p1_0)
   added: (at_ driver1 s0)
   goals met: 2 of 4
5. (board_truck driver1 truck1 s0)
   deleted: (at_ driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 2 of 4
6. (drive_truck truck1 s0 s1 driver1)
   deleted: (at_ truck1 s0)
   added: (at_ truck1 s1)
   goals met: 3 of 4
7. (disembark_truck driver1 truck1 s1)
   deleted: (driving driver1 truck1)
   added: (at_ driver1 s1) (empty truck1)
   goals met: 4 of 4
